app/controllers/participantes_controller.rb

SELECT * FROM "participantes" WHERE ("participantes".sorteio_id = 4)
---
  def index
    @participantes = Participante.find(:all)

SELECT * FROM "participantes" WHERE ("participantes"."id" = 6 AND ("participantes".sorteio_id = 4))
---
  def show
    @participante = Participante.find(params[:id])

SELECT * FROM "participantes" WHERE ("participantes"."id" = 8 AND ("participantes".sorteio_id = 4))
---
  def edit
    @participante = Participante.find(params[:id])

INSERT INTO "participantes" ("created_at", "nome", "updated_at", "sorteio_id", "email") VALUES('2009-12-10 18:50:58', 'tiago', '2009-12-10 18:50:58', NULL, 'tig.luiz.almeida@gmail.com')
---
  def create
    @participante = Participante.new(params[:participante])

    respond_to do |format|
      if @participante.save

SELECT * FROM "participantes" WHERE ("participantes"."id" = 8 AND ("participantes".sorteio_id = 4))
UPDATE "participantes" SET "updated_at" = '2009-12-18 16:25:02', "email" = 'ricardo.gmail.com' WHERE "id" = 2
---
  def update
    @participante = Participante.find(params[:id])

    respond_to do |format|
      if @participante.update_attributes(params[:participante])

SELECT * FROM "participantes" WHERE ("participantes"."id" = 6 AND ("participantes".sorteio_id = 4))
DELETE FROM "participantes" WHERE "id" = 6
---
  def destroy
    @participante = Participante.find(params[:id])
    @participante.destroy