app/controllers/sorteios_controller.rb

  def show
    @sorteio = Sorteio.find(params[:id])
---
SELECT * FROM "sorteios" WHERE ("sorteios"."id" = 1)

  def edit
    @sorteio = Sorteio.find(params[:id])
---
SELECT * FROM "sorteios" WHERE ("sorteios"."id" = 1)

  def create
    @sorteio = Sorteio.new(params[:sorteio])

    respond_to do |format|
      if @sorteio.save
---
INSERT INTO "sorteios" ("created_at", "updated_at") VALUES('2009-12-09 19:21:28', '2009-12-09 19:21:28')

  def destroy
    @sorteio = Sorteio.find(params[:id])
    @sorteio.destroy
---
SELECT * FROM "sorteios" WHERE ("sorteios"."id" = 2)
DELETE FROM "sorteios" WHERE "id" = 2